#include <iostream>

int main()
{
	for (int i = 0; i <= 20; i += 2)
		std::cout << i << " ";
}

/*
Напишите цикл for, который выводит каждое четное число в диапазоне от 0 до 20.
*/